/// @description Insert description here
// You can write your code in this editor
t = 0; // глобальный таймер
state = 1;
// События
/*
1 Скелеты по прямой 5 - 6 штук
2 Скелеты закругляющиеся (Быстрая стрельба)
3 Мины + много скелетов в игрока
4 Скелет по прямой + Скелет стреляющий издалека 
5 Камни 
6 Скелет стреляющий издалека вверхвниз 
7 Камни + Скелет стреляющий издалека + Скелеты закругляющиеся 
8 Водоросль (Быстрая стрельба)
9 Скелеты направляющиеся в игрока
10 Камни + водоросли
11 Скелеты волной + скелеты по прямой (быстрая стрельба)
12 Скелеты стреляющие издалека вверхвниз + скелеты в игрока (Пушка-пулемет)
13 Скелет по прямой + Скелет в игрока + Скелет издалека + мина
14 Препятствие полное
15 Препятсвтие половина + водоросли
16 Водоросль + мина + Скелет в игрока + Скелет Стреляющий вверх вниз ( Пушка-пулемет)
17 Водоросль + мина + Препятствие половина + Скелет в игрока + Скелет по прямой + 
   Скелет издалека



*/

